Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В столбцы:
en: To columns:

source: В строки:
en: To rows:

source: Переменные в таблицу
en: Variables to Table

source: Формирование таблицы данных из набора переменных
en: Create dataset from variables set

source: Расширение связывания порта "%s" не указано или не поддерживается
en: "%s" port binding extension not specified or not supported

source: Поддержка настройки "Временная зона по умолчанию" не реализована в версии приложения под Linux (указана временная зона "%s")
en: "Default time zone" configuration is not supported in the Linux application version ("%s" time zone is specified)

source: Временная зона "%s" не поддерживается
en: "%s" time zone is not supported

source: Имя исключения
en: Exception name

source: Исключения (WSDL fault)
en: Exceptions (WSDL fault)

source: Файл "%s" не доступен
en: "%s" file not available

source: Идентификатор части
en: Part identifier

source: Сырой ответ
en: Raw Response

source: Подключение к SOAP-сервису
en: Connection to SOAP service

source: Привязка "%s" для конечной точки (порта) "%s" не найдена
en: "%s" binding for "%s" endpoint (port) not found

source: Ошибка при выполнении запроса с идентификатором %s: %s
en: Error executing request with %s identifier: %s

source: Ошибка при выполнении запроса: %s
en: Error executing request: %s

source: Ошибка при выполнении запроса, сформированного из строки №%d входного набора: %s
en: Error executing request generated from row #%d of the input dataset: %s

source: SOAP-запрос: %s
en: SOAP Request: %s

source: Конфигурация запроса к веб-сервису содержит ошибки
en: Web service request configuration contains errors

source: XSD-схема на входе не соответствует настройкам обработчика.
en: Input XSD schema does not comply with the node settings.

source: Тип данных столбца %s не совместим с типом данных узла дерева %s
en: The data type of %s column does not match the data type of %s tree node

source: Узел %s, для которого запрошен подбор столбца входного набора, не входит в дерево запроса
en: %s node for which input set column selection is requested not included in the request tree

source: Не выбрано ни одного узла для импорта ответа сервиса
en: No nodes selected for service response import

source: Операция "%s" не найдена в описании конечной точки "%s" сервиса "%s"
en: "%s" operation not found in "%s" endpoint description of "%s" service

source: Типы расширений связывания "%s" и операции "%s" не совпадают
en: Types of "%s" binding extensions and "%s" operations do not match

source: Не выбрана операция WSDL для осуществления запроса
en: No WSDL operation selected for request execution

source: Элемент "%s", на который ссылается часть "%s" сообщения "%s" операции "%s", не найден в XSD-схеме
en: "%s" element referenced in "%s" part of "%s" message of "%s" operation not found in XSD schema

source: Не выбрана конечная точка сервиса WSDL для осуществления запроса
en: No WSDL service endpoint for the request execution selected

source: Ответ сервиса не настроен
en: Service response not configured

source: Операции с примитивом обмена "%s" не поддерживаются
en: Operations with "%s" exchange primitive are not supported

source: Узел %s, для которого запрошен сброс связи, не входит в дерево запроса
en: %s node for which link reset is requested is not included in the request tree

source: SOAP-запрос
en: SOAP Request

source: Выполняет запрос через подключение к веб-сервису, описанному WSDL, и преобразует полученный ответ в набор данных
en: Request execution through connection to WSDL described web service and conversion of the received response into a dataset

source: Невозможно перейти по адресу: %s
en: Failed to go to the following address: %s

source: Local Storage не прочитано
en: Local Storage load failed

source: Невозможно определить примитив обмена данными для операции %s, тип порта %s
en: Failed to define data exchange primitive for %s operation, %s port type

source: Local Storage не сохранено
en: Local Storage save failed

source: Добавление записей в таблицу
en: Adding records to table

source: дополнить таблицу
en: append table

source: Создание таблицы
en: Creating the table

source: Удаление записей из таблицы
en: Deleting records from table

source: удалить по ключам
en: delete by keys

source: Удаление существующей таблицы
en: Deleting an existing table

source: Ошибка в определении операции %s, тип порта %s: сообщение fault должно содержать в точности одну часть
en: Error defining %s operation, %s port type: fault message must contain exactly one part

source: В источнике данных не найдена колонка "%s"
en: "%s" column not found in the data source

source: Тип столбца "%s" не совместим с типом исходного столбца "%s"
en: "%s" column type is not compatible with "%s" source column type

source: Не указано ни одного соответствия с источником данных
en: No data source mapping provided

source: Ошибка при выполнении экспорта в БД
en: Error while exporting to DB

source: Не указано ни одного поля, по которому необходимо удалить данные
en: No fields by which data should be deleted specified

source: Не указано ни одного поля, которое необходимо обновить
en: No fields to update specified

source: Не удалось заполнить таблицу %s
en: Failed to fill the table: %s

source: Не указано ни одного ключевого поля, по которому необходимо обновить данные
en: No key field by which data should be updated specified

source: В объявлении HTTP связывания "%s" для операции "%s" отсутствует обязательный элемент расширения "<http:operation/>"
en: No required extension element "<http:operation/>" in "%s" binding HTTP declaration for "%s" operation

source: Ошибка синхронизации: в таблице не найдено ключевое поле "%s"
en: Synchronization error: "%s" key field not found in the table

source: Ошибка синхронизации: не найдено поле-источник для ключевого поля "%s"
en: Synchronization error: source field not found for "%s" key field

source: Ошибка синхронизации: тип ключевого поля "%s" не совместим с типом исходного поля "%s"
en: Synchronization error: "%s" key field type is not compatible with "%s" source field type

source: Выполнение запроса
en: Executing the query

source: Получение списка полей
en: Preparing field list

source: Часть "%s", входящая в сообщение "%s" типа "%s" (операция "%s"), ссылается на элемент XSD-схемы %s{%s}, имеющий сложный тип
en: "%s" part included into "%s" message of "%s" type ("%s" operation) refers to %s{%s} XSD schema element related to the complex type

source: Получение информации о типах данных
en: Receiving data types information

source: Группировка данных
en: Grouping data

source: число строк в пачке меньше %d
en: row count in batch less than %d

source: Переключение на добавление записей через INSERT. Причина:
en: Switching to adding records via INSERT. Reason:

source: очистить и заполнить
en: clear and fill in

source: Пересоздание таблицы
en: Re-creating the table

source: удалить записи и дополнить
en: delete records and add

source: Статус выполнения
en: Execution status

source: заполнить после TRUNCATE
en: fill in after TRUNCATE

source: Часть "%s", входящая в сообщение "%s" типа "%s" (операция "%s"), ссылается на сложный тип XSD-схемы %s{%s}
en: "%s" part included into "%s" message of "%s" type ("%s" operation) refers to the complex type of %s{%s} XSD schema

source: Функция с именем %s уже зарегистрирована
en: %s named function has already been registered

source: Выполнение TRUNCATE таблицы
en: Truncating the table

source: обновить записи
en: update records

source: База данных
en: Database

source: Экспорт в базу данных через настроенное подключение
en: Export to database through configured connection

source: Имя листа excel не может содержать символы: ? * / [ ]
en: The excel sheet name cannot contain the following characters: ? * / [ ]

source: Имя листа excel не может быть длиннее 31 символа
en: Excel sheet name cannot be longer than 31 characters

source: Не задано имя листа
en: No sheet name specified

source: Элемент XSD-схемы <import/> должен содержать атрибут namespace
en: Element <import/> of the XSD schema must include a namespace attribute

source: Сохранение в файл
en: Saving to file

source: Экспортировано %d колонок данных из %d
en: %d out of %d data columns exported

source: Экспортировано %d строк данных из %d
en: %d out of %d data rows exported

source: Запись данных в книгу Excel
en: Writing data to Excel workbook

source: Excel файл
en: Excel File

source: Экспорт данных в файл Excel
en: Export data to Excel file

source: Не удалось экспортировать сообщение: %s
en: Failed to export message: %s

source: Ошибка отправки сообщений Kafka: %s
en: Error when flushing Kafka messages: %s

source: Поле ключей должно быть строкового или целого типа
en: Key field must be related to the string or integer type

source: Поле ключей с именем "%s" не найдено
en: Key field with "%s" name not found

source: Содержимое входящего сообщения сервиса должно иметь конкретный MIME-тип (фактически - %s)
en: The incoming service message content must relate to the specific MIME type (actually - %s)

source: Поле сообщений должно быть строкового типа
en: Message field must be related to the string type

source: Поле сообщений с именем "%s" не найдено
en: Message field with "%s" name not found

source: За %d итераций не отправлено ни одного сообщения
en: No message sent in %d iterations

source: Отправка сообщений в Kafka
en: Sending messages to Kafka

source: Завершение отправки сообщений
en: Flushing all messages

source: В очередь добавлено %d сообщений для пачки из %d
en: %d messages for batch from %d added to queue

source: Для строки %d, сообщение не создано. Поле сообщения или ключа содержит пропущенное значение
en: Message was not created for row %d. The message or key field contains the null value

source: Количество сообщений в пачке не может быть меньше 1
en: Message count in the batch cannot be less than 1

source: Не задано поле с сообщениями
en: No field with messages set

source: Не задан топик
en: No topic set

source: Недопустимый MIME-тип: %s
en: Invalid MIME type: %s

source: Экспорт в очередь Kafka
en: Export to Kafka queue

source: Сжатие LZ4 недоступно
en: LZ4 compression not available

source: Сжатие LZO недоступно
en: LZO compression not available

source: Экспорт данных в Loginom Data файл
en: Export data to Loginom Data file

source: Ошибка инициализации Tableau API
en: Tableau API initialization error

source: Одновременное добавление и перезаписывание записей невозможно
en: It is not possible to append and overwrite records simultaneously

source: Невозможно создать пустую таблицу
en: Failed to create empty table

source: Тип элемента массива "%s" не найден в схеме
en: Array item type "%s" not found in schema

source: В источнике данных не найдено поле "%s"
en: "%s" field not found in the data source

source: Тип поля "%s" не совместим с типом исходного поля "%s"
en: "%s" field type is not compatible with "%s" source field type

source: Не удалось создать таблицу "%s"
en: Failed to create "%s" table

source: Не удалось пересоздать таблицу "%s"
en: Failed to re-create "%s" table

source: Ошибка при выполнении экспорта в файл Tableau
en: Error while exporting to Tableau file

source: Расширение "%s" не является правильным расширением файла Tableau Extract
en: "%s" extension is not a correct extension of Tableau Extract file

source: Tableau Extract SDK не установлено
en: Tableau Extract SDK not installed

source: Не удалось получить путь к файлу
en: Failed to get path to file

source: Определение сообщения "%s" не содержит части с именем "%s"
en: "%s" message definition does not contain the part with"%s" name

source: Tableau Extract API 2.0 SDK не установлено
en: Tableau Extract API 2.0 SDK not installed

source: Формат данных "*.hyper" поддерживается только в 64-битной версии программы
en: "*.hyper" data format supported only in 64-bit software version

source: Отсутствует подключение к серверу Tableau
en: No connection with Tableau server

source: Отсутствуют описания колонок
en: Column definitions missing

source: Не найдено файловое хранилище
en: No file storage found

source: Таблица "%s" уже существует
en: "%s" table already exists

source: Не найдена таблица "%s"
en: No "%s" table found

source: Определение сообщения "%s" не найдено в документе
en: "%s" message definition not found in the document

source: Подключение к файловому хранилищу
en: Connection to file storage

source: Публикация файла на сервер
en: Publishing file on server

source: Подключение к серверу Tableau
en: Connection to Tableau server

source: Tableau файл
en: Tableau file

source: Экспорт данных в файл Tableau
en: Data export to Tableau file

source: Расчет ширины столбцов
en: Calculating column width

source: Запись данных в файл
en: Writing data to file

source: Экспорт данных в текстовый файл
en: Export data to text file

source: Для выполнения операции необходимо сначала выбрать корневой элемент XML для экспорта
en: To perform the operation it is required to select the root XML element for export first

source: Сообщение "%s", на которое ссылается операция "%s" связывания "%s", не найдено
en: "%s" message referenced by "%s" operation of "%s" binding not found

source: Дерево экспорта не настроено
en: Export tree not configured

source: Конфигурация содержит ошибки
en: Errors in configuration

source: Узел %s, для которого запрошен подбор столбца входного набора, не входит в дерево экспорта
en: %s node for which input set column selection is requested is not included into the export tree

source: Узел %s не является потомком выбранного корневого элемента %s
en: %s node is not a descendant of the selected %s root element

source: Узел "%s" не найден в XSD-схеме
en: "%s" node not found in XSD schema

source: Узел "%s" не является корневым элементом XSD-схемы
en: "%s" node is not XSD schema root element

source: На входе компонента отсутствует XSD-схема
en: There is no XSD schema at the component input

source: Не выбран корневой элемент для экспорта
en: No root element selected for export

source: Расширение сообщения "%s" (операция "%s" связывания "%s") не указано или не поддерживается
en: "%s" message extension ("%s" operation of "%s" binding) not specified or not supported

source: Узел %s, для которого запрошен сброс связи, не входит в дерево экспорта
en: %s node for which link reset is requested is not included into the export tree

source: Ошибка при выполнении экспорта XML. Код ошибки: %d. Сообщение: %s
en: Error exporting XML. Error code: %d. Message: %s

source: Экспорт набора данных
en: Exporting dataset

source: Запись XML-файла
en: Writing XML file

source: Подключение к источнику XSD-схемы
en: Connection to XSD schema source

source: Экспорт данных в файл XML в соответствии с заданной схемой XSD
en: Export data to XML file according to the specified XSD schema

source: Не удалось преобразовать значение из результата запроса к стандартному типу
en: Failed to convert value from query result to standard type

source: Импортирование данных
en: Importing data

source: Версия SOAP сообщения %s конфликтует с версией операции %s
en: SOAP version of %s message conflicts with %s operation version

source: Не установлено подключение к информационной базе
en: Not connected to infobase

source: Открытие запроса
en: Opening the query

source: 1С Запрос
en: 1C Query

source: 1С:Предприятие 8 - Запрос
en: 1C:Enterprise 8 - Query

source: Элемент "<%s/>" без атрибута part ссылается на определение сообщения "%s", которое содержит более одной части либо не содержит ни одной
en: "<%s/>" element without part attribute refers to "%s" message definition, which contains more than one part or does not contain any

source: Функция %s может принимать только четное число аргументов
en: %s function can accept only even number of arguments

source: Не указана таблица базы данных
en: Database table not specified

source: Открытие таблицы
en: Opening the table

source: Элементу расширения mime:content в сообщении "%s" (операция "%s") сопоставлена часть "%s", которая ссылается на элемент XSD-схемы %s{%s}, имеющий сложный тип
en: mime:content extension element in "%s" message ("%s" operation) is associated with "%s" part that refers to %s{%s} XSD schema element related to the complex type

source: Импорт из базы данных через настроенное подключение
en: Import from database by configured connection

source: Не удалось получить данные листа Excel
en: Failed to get Excel worksheet data

source: Автоопределение новых столбцов
en: Autodetecting new columns

source: В поле "%s" значение "%s" не удалось преобразовать к логическому значению.
en: Failed to convert "%1:s" value in "%0:s" field to logical value.

source: Поле с именем "%s" уже существует
en: "%s" field already exists

source: Элементу расширения mime:content в сообщении "%s" (операция "%s") сопоставлена часть "%s", которая ссылается на сложный тип XSD-схемы %s{%s}
en: mime:content extension element in "%s" message ("%s" operation) is associated with "%s" part that refers to the complex type of %s{%s} XSD schema

source: Имя "%s" не может являться идентификатором
en: "%s" cannot be an identifier

source: Не удалось выполнить операцию, файл Excel не открыт
en: Operation failed, Excel file not open

source: Файл excel не открыт. По текущим настройкам невозможно определить диапазон для импорта данных
en: Excel file is not open. According to the current settings it is impossible to determine the range for data import

source: Диапазон задан не верно
en: Invalid range

source: Ошибка книги Excel, диапазон листа задан некорректно
en: Excel workbook error, incorrect sheet range

source: Не удалось открыть Excel файл %s
en: Failed to open %s Excel file

source: При разборе строки %d возникла ошибка: %s
en: Error occurred while parsing line %d: %s

source: Некорректно задан именованный диапазон
en: Invalid named range

source: Элемент <definitions/> WSDL-описания отсутствует или не принадлежит пространству имен WSDL
en: <definitions/> element of WSDL description is missing or does not belong to the WSDL namespace

source: Не задано название именованного диапазона
en: Named range name not specified

source: Именованный диапазон "%s" не найден в файле "%s"
en: "%s" named range not found in "%s" file

source: Не задано имя листа Excel
en: Excel sheet name not specified

source: Индекс листа Excel задан некорректно
en: Incorrect Excel worksheet index

source: Не удалось найти лист Excel
en: Failed to find Excel sheet

source: Файл excel не открыт. По текущим настройкам невозможно определить количество столбцов для импорта
en: Excel file is not open. According to the current settings it is impossible to determine the column count for import

source: Импортируемые поля не определены
en: Fields to import not specified

source: Открытие файла
en: Opening the file

source: Чтение данных
en: Reading data

source: Чтение метаданных файлов
en: Reading files' metadata

source: "%s" не является описанием типа массива
en: "%s" is not an array type description

source: Чтение метаданных файла
en: Reading file's metadata

source: Импорт данных из файла Excel
en: Import data from Excel file

source: Ошибка закрытия Consumer: %s
en: Error when closing Consumer: %s

source: Ошибка при получении сообщения Kafka: %s
en: Error when receiving Kafka messages: %s

source: не удалось: %s
en: Failed: %s

source: Группа %s перебалансирована (id участника %s)
en: Group %s rebalanced (memberid %s)

source: Чтение сообщений из очереди Kafka
en: Reading messages from Kafka queue

source: Перебалансировка группы %s: поэтапное назначение %d партиций (идентификатор участника %s, присвоение потеряно %d, протокол перебалансировки %s)
en: Group %s rebalanced: incremental assignment of %d partition(s) (memberid %s, assignment lost %d, %s rebalance protocol)

source: Перебалансировка группы %s: поэтапный отзыв %d партиций (идентификатор участника %s, присвоение потеряно %d, протокол перебалансировки %s)
en: Group %s rebalanced: incremental revoke of %d partition(s) (memberid %s, assignment lost %d, %s rebalance protocol)

source: Операция "%s", на которую ссылается связывание "%s", не найдена в определении типа порта "%s"
en: "%s" operation referenced by "%s" binding not found in "%s" port type definition

source: Получено максимальное количество сообщений %d. Импорт остановлен
en: Maximum number of %d messages reached. Import stopped

source: Сообщение
en: Message

source: Партиция
en: Partition

source: Не задан идентификатор группы
en: Group identifier not set

source: Смещение должно быть больше или равно 0
en: Offset must be equal or more than 0

source: Не удалось назначить перебалансировку %d партиций: %s
en: Rebalance assign of %d partition(s) failed: %s

source: Не удалось отменить назначение перебалансировки %d партиций: %s
en: Rebalance unassign of %d partition(s) failed: %s

source: Расширение операции "%s" связывания порта "%s" не указано или не поддерживается
en: "%s" operation extension of "%s" port binding not specified or not supported

source: Не удалось подписаться на %d топиков: %s
en: Failed to subscribe to %d topics: %s

source: Ожидание ребаланса группы
en: Waiting for group rebalance

source: Импорт очереди Kafka
en: Import of Kafka queue

source: Произошла ошибка при чтении заголовка
en: Header reading error

source: Строковые данные некорректны
en: Invalid string data

source: Файл содержит слишком большое число строк
en: File contains too many rows

source: Данные типа Variant некорректны
en: Invalid Variant data

source: Невозможно конвертировать данные в 32-битный формат
en: Failed to convert data to 32-bit format

source: Часть "%s" не ссылается на определения схемы
en: "%s" part does not reference schema definitions

source: Неизвестная операция конвертера строки
en: Unknown string converter operation

source: Метаданные не соответствуют ранее объявленным
en: Metadata does not comply with the previously declared metadata

source: В заголовке файла указано недопустимое число строк %d
en: Invalid rows count %d is specified in the file header

source: Смена типа столбца "%s" в Импорте LGD не поддерживается
en: Change of "%s" column type is not supported in LGD Import

source: Часть "%s" определена элементом, а не типом XSD-схемы
en: "%s" part defined by element and not by XSD schema type

source: Неподдерживаемый подтип типа Variant
en: Unsupported Variant subtype

source: Операция не поддерживается
en: Operation not supported

source: Массивы в переменных типа Variant не поддерживаются
en: Unsupported arrays in Variant variables

source: Переменные типа Variant byRef не поддерживаются
en: Unsupported Variant byRef type

source: Неподдерживаемая маска типа Variant
en: Unsupported Variant type mask

source: Часть "%s" определена типом, а не элементом XSD-схемы
en: "%s" part defined by type and not by XSD schema element

source: Файл не является Loginom Data файлом
en: Not Loginom Data file

source: Несоответствие сигнатуры
en: Signature mismatch

source: Разрядность не поддерживается
en: Bitness not supported

source: Некорректная версия
en: Invalid version

source: Неизвестное сжатие
en: Unknown compression

source: Файл был открыт в режиме совместимости
en: File was opened in compatibility mode

source: Импорт данных из Loginom Data файла
en: Import data from Loginom Data file

source: Ошибка LZ4-блока
en: LZ4-block error

source: Ошибка контрольной суммы
en: Checksum error

source: Типы расширений порта "%s" и связывания "%s" не совпадают
en: "%s" port and "%s" binding extensions do not match

source: Неверное имя функции %s
en: Invalid %s function name

source: В колонке "%s" значение "%s" не удалось преобразовать к логическому значению.
en: Failed to convert "%1:s" value in "%0:s" column to logical value.
